posts/qbqn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>BQN's Quantum Noise</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../assets/style.css"/>
<link rel="icon" href="../assets/favicon.ico" type="image/x-icon">
<!-- Post-specific setting bellow -->

</head>
<body>
<div id="content" class="content">
<h1 class="title">BQN's Quantum Noise</h1>
<div id="outline-container-org365cf80" class="outline-2">
<h2 id="org365cf80">Preamble</h2>
<div class="outline-text-2" id="text-org365cf80">
<p>
We will implement and test a Schrödinger-style<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> quantum simulator in the BQN<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> programming language.
Initially, we import the necessary system functions and define a 1-modifier for handling
complex-valued matrix products. Next, we define a namespace containing various quantum gates:
</p>

<div class="org-src-container">
<pre class="src src-bqn" id="org0470ab3">Sin‿Cos‿GCD ← •math
U ← •rand.Range
_cp ← {(-´𝔽¨)⋈(+´𝔽¨)⟜⌽}

g ← {
  IM ← (⊢⋈≢⥊⟜0⊢)¨
  x‿id‿h ⇐ (⌽‿⊢{𝕎𝕩}¨&lt;=⌜˜↕2) ∾○IM &lt;-⌾(1‿1⊸⊑)2‿2⥊÷√2
  swap‿cnot ⇐ IM ⟨1‿2, 2‿3⟩ {⌽⌾(𝕨⊸⊏)𝕩}¨ &lt;=⌜˜↕4
  P ⇐ {⟨=⌜˜↕4,  4‿4⥊0⟩ {𝕨⌾(3‿3⊸⊑)𝕩}¨˜ Sin⊸⋈⟜Cos𝕩}
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf9971d5" class="outline-2">
<h2 id="orgf9971d5">Interpreter</h2>
<div class="outline-text-2" id="text-orgf9971d5">
<p>
The (282 chars<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>) quantum interpreter is based on references <a href="https://arxiv.org/abs/1711.02086">arXiv:1711.02086</a>
and <a href="https://arxiv.org/abs/1608.03355">arXiv:1608.03355</a>. For simplicity, we always measure at the end of the execution:
</p>

<div class="org-src-container">
<pre class="src src-bqn" id="org7d22567">Q ← {𝕨𝕊nq‿qc:
  wf ← 1⌾⊑⊸⋈0⥊˜2⋆nq
  M ← +˝∘×⎉1‿∞ _cp
  K ← {1𝕊𝕩:𝕩; 𝕨𝕊1:𝕨; 𝕨∾∘×⟜&lt;_cp𝕩}
  L ← {𝕩K⍟𝕨1}{K´⟨g.id𝔽˜nq-𝕨+⌊2⋆⁼≠⊑𝕩, 𝕩, 𝕨𝔽g.id⟩}
  T ← ∾↕∘≠{(⊢∾1↓⌽)𝕨↓↕𝕨⊑⟜𝕩˜•_while_&gt;𝕨⊑𝕩}¨&lt;
  A ← {1=≠⊑𝕨 ? 𝕩M˜⊑⊸L´𝕨;
    𝕩M´⟨0⊸L´𝕨⟩(⊢∾∾⟜⌽)L⟜g.swap¨T𝕨(⌽∘⊢∾¬∘∊/⊣)⟜⊑˜↕nq
  }
  »⊸&lt;∨`0&gt;𝕨-`+○(×˜)´wf A´ ⌽qc
}
</pre>
</div>

</br>
<details>
<summary>Physical context</summary>

<p>
The interpreter’s logic is straightforward: it evolves the wavefunction \(\Psi_0^n\)  
in the full <a href="https://en.wikipedia.org/wiki/Hilbert_space">Hilbert space</a>, whose dimension is \(2^n\) for \(n\) qubits.  
Each quantum gate is extended to this space through Kronecker lifting,  
performed by the function <code>L</code>:
</p>

\begin{equation*}
  L_U = I \otimes \cdots U \cdots \otimes I
\end{equation*}

<p>
Note that the function <code>L</code> performs more than a plain Kronecker embedding.  
Before constructing \(L_U\), the affected qubits are permuted to become  
index-adjacent in the tensor order. This permutation is decomposed into  
adjacent swaps, applied as unitary transpositions (<code>T</code>). The system then evolves
under the sequence of lifted gates, defined by <code>A</code>:
</p>

\begin{equation*}
\Psi_m^n = \Psi_0^n \prod_i^m L_{U_i}
\end{equation*}

<p>
Measurement is implemented by sampling from the <a href="https://en.wikipedia.org/wiki/Cumulative_distribution_function">CDF</a> of the squared amplitudes of the state vector.  
Statistically, this corresponds to drawing a discrete random variable \(q_j\) whose  
cumulative distribution is:
</p>

\begin{equation*}
  F(q_j) = \sum_{i \le j}p(q_i)
\end{equation*}

<p>
Given a uniform random variable \(U \sim \text{Uniform}(0, 1)\), we sample by inversion:
</p>

\begin{equation*}
  \text{Pr}(U \in (F(q_{j-1}), F(q_{j})]) = \text{Pr}(F(q_{j-1}) < U \le F(q_{j})) = F(q_{j}) - F(q_{j-1}) = p(q_{j})
\end{equation*}

</details>
</div>
</div>
<div id="outline-container-org70874d1" class="outline-2">
<h2 id="org70874d1">Shor's algorithm</h2>
<div class="outline-text-2" id="text-org70874d1">
<p>
As a test case, we employ the quantum circuit of Shor's algorithm
for the number fifteen and base eleven, following references
<a href="https://arxiv.org/abs/1804.03719">arXiv:1804.03719</a> and <a href="https://arxiv.org/abs/2306.09122">arXiv:2306.09122</a>. The resulting compiled circuit
uses five qubits, three of which serve as control. To enhance
statistical accuracy, the experiment is repeated multiple times.
</p>

<div class="org-src-container">
<pre class="src src-bqn" id="orge551453">n‿a‿nq‿r ← ⟨15, 11, 5, 0 U˜ 2⋆10⟩

sc ← ⟨
  ⟨0⟩‿g.h ⋄ ⟨1⟩‿g.h ⋄ ⟨2⟩‿g.h
  ⟨2, 3⟩‿g.cnot ⋄ ⟨2, 4⟩‿g.cnot ⋄ ⟨1⟩‿g.h
  ⟨⟨1, 0⟩, g.P π÷2⟩ ⋄ ⟨0⟩‿g.h
  ⟨⟨1, 2⟩, g.P π÷4⟩ ⋄ ⟨⟨0, 2⟩, g.P π÷2⟩ ⋄ ⟨2⟩‿g.h
⟩

C ← {n (⊣≡×´∘GCD) +‿-{𝕩𝕎1}¨ &lt;a⋆(≠÷2×⊑∘⍒) 0⌾⊑+˝∘‿(2⋆nq-2)⥊𝕩}
</pre>
</div>

<p>
The function <code>C</code> performs the classical post-processing part of the algorithm.
Given the measurement registers, it reconstructs the candidate period \(r\) and
checks the Shor certificate: it is true iff both \(\gcd(a^{\,r/2}\pm 1,N)\)
are non-trivial and their product equals \(N\).
</p>

<p>
Let’s run the quantum simulation and complete the reasoning in the classical domain;
let us kill the ignorabimus. Wir müssen wissen, wir werden wissen!<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-bqn" id="orgb9cf29e">C +´Q⟜nq‿sc¨r
</pre>
</div>

<pre class="example">
1
</pre>


<p>
Compare the result with that obtained using an IBM's <a href="https://panadestein.github.io/blog/supp/ibm_eagle/shor_factorize_fifteen.html">Eagle QPU</a>!
</p>
</div>
</div>
<div id="outline-container-orgb63c254" class="outline-2">
<h2 id="orgb63c254">Epilogue</h2>
<div class="outline-text-2" id="text-orgb63c254">
<p>
This was, of course, a conceptually simple simulation, the minimal instance of  
Shor’s algorithm that has been verified experimentally. The interpreter itself  
remains in its basic, non-optimized form. Yet for me, the goal was different:  
to stress-test BQN on a genuinely technical task. I enjoyed distilling the  
essence of a long and intricate implementation into a few concise expressions,  
like trimming a bonsai.
</p>

<p>
In that process, the language revealed its character.  
Why the hieroglyphs, you may ask? The tacit and functional style woven from  
combinators, turns programming into a quiet algebraic game.  
The resulting program feels less written than discovered, its complexity  
compressed into a handful of primitives. BQN is the epitome of minimalism's  
power, and the primitive statistics below tell the same story in numbers:
</p>

<details>
<summary>Primitive's stats</summary>

<p>
The <code class="src src-bqn">prog</code> string contains the full source code. We used:
</p>

<div class="org-src-container">
<pre class="src src-bqn">prog (+´⊸≍⟜≠∊)˜ ⊑¨•primitives
</pre>
</div>

<pre class="example" id="orgbd40dc1">
⟨ 43 64 ⟩
</pre>

<p>
With this distribution:
</p>

<div class="org-src-container">
<pre class="src src-bqn">prog (⍉·⌽˘∘∨⊣≍˘˜≠∘⊣↑/⁼∘⊐)˜"•↩←⇐·𝕊𝕏𝕎𝔽𝔾𝕤𝕩𝕨𝕣𝕗𝕘"∾⊑¨•primitives
</pre>
</div>

<pre class="example" id="orgbcd66cc">
┌─                                                                                                                                                                                                                                                                                                                                 
╵ '𝕩' '𝕨' '←' '⊑' '˜' '¨' '´' '⟜' '⊸' '∘' '⌽' '∾' '&lt;' '+' '⊢' '↕' '-' '⥊' '⌾' '⋆' '÷' '×' '𝔽' '⋈' '≠' '=' '𝕊' '⌜' '⇐' '•' '˝' '&gt;' '𝕎' '○' '⊣' '↓' '`' '⎉' '⍟' '⍒' '⌊' '⊏' '≢' '≡' '∨' '√' '∊' '⁼' '»' '¬' '/' '𝕤' '𝕣' '𝕘' '𝕗' '𝕏' '𝔾' '⚇' '◶' '⎊' '⍷' '⍋' '⍉' '⌈' '⊘' '⊔' '⊒' '⊐' '≥' '≤' '≍' '∧' '↩' '↑' '˙' '˘' '·' '«' '|' '!'  
  17  15  15  11  11  10  9   8   8   8   7   7   7   7   6   6   6   5   5   5   5   5   4   4   4   4   3   3   3   3   3   3   2   2   2   2   2   1   1   1   1   1   1   1   1   1   1   1   1   1   1   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0    
                                                                                                                                                                                                                                                                                                                                  ┘
</pre>

</details>

<p>
BQN is also fast:
</p>


<details>
<summary>Benchmarks</summary>

<p>
Here is a comparison with the reference, not particularly optimized Common Lisp code running
also 1024 samples:
</p>

<pre class="example" id="org2263557">
Benchmark 1: cbqn -f ../bqn/q.bqn
  Time (mean ± σ):     806.9 ms ± 118.0 ms    [User: 800.6 ms, System: 2.9 ms]
  Range (min … max):   752.2 ms … 1017.9 ms    5 runs
 
Benchmark 2: sbcl --script ../../supp/perf_qi/q.lisp
  Time (mean ± σ):     37.015 s ±  0.184 s    [User: 37.271 s, System: 0.223 s]
  Range (min … max):   36.826 s … 37.286 s    5 runs
 
Summary
  cbqn -f ../bqn/q.bqn ran
   45.87 ± 6.71 times faster than sbcl --script ../../supp/perf_qi/q.lisp
</pre>

<p>
And here is a full program's profile. All time is spent in the Kronecker and matrix products:
</p>

<div class="org-src-container">
<pre class="src src-bqn">)profile C +´Q⟜nq‿sc¨r
</pre>
</div>

<pre class="example" id="orgf994405">
Got 5598 samples
GC: 12 samples
(REPL): 5567 samples:
     1│Q ← {𝕨𝕊nq‿qc:
     1│  wf ← 1⌾⊑⊸⋈0⥊˜2⋆qb
      │  M ← +˝∘×⎉1‿∞ _cp
  2977│  K ← {1𝕊𝕩:𝕩; 𝕨𝕊1:𝕨; 𝕨∾∘×⟜&lt;_cp𝕩}
    86│  L ← {𝕩K⍟𝕨1}{K´⟨g.id𝔽˜nq-𝕨+⌊2⋆⁼≠⊑𝕩, 𝕩, 𝕨𝔽g.id⟩}
    26│  T ← ∾↕∘≠{(⊢∾1↓⌽)𝕨↓↕𝕨⊑⟜𝕩˜•_while_&gt;𝕨⊑𝕩}¨&lt;
   284│  A ← {1=≠⊑𝕨 ? 𝕩M˜⊑⊸L´𝕨;
  2186│    𝕩M´⟨0⊸L´𝕨⟩(⊢∾∾⟜⌽)L⟜g.swap¨T𝕨(⌽∘⊢∾¬∘∊/⊣)⟜⊑˜↕nq
      │  }
     6│  »⊸&lt;∨`0&gt;𝕨-`+○(×˜)´wf A´ ⌽qc
      │}
(REPL): 19 samples:
      │Sin‿Cos‿GCD ← •math
      │U ← •rand.Range
    19│_cp ← {(-´𝔽¨)⋈(+´𝔽¨)⟜⌽}
      │  
      │g ← {
      │  IM ← (⊢⋈≢⥊⟜0⊢)¨
      │  x‿id‿h ⇐ (⌽‿⊢{𝕎𝕩}¨&lt;=⌜˜↕2) ∾○IM &lt;-⌾(1‿1⊸⊑)2‿2⥊÷√2
      │  swap‿cnot ⇐ IM ⟨1‿2, 2‿3⟩ {⌽⌾(𝕨⊸⊏)𝕩}¨ &lt;=⌜˜↕4
      │  P ⇐ {⟨=⌜˜↕4,  4‿4⥊0⟩ {𝕨⌾(3‿3⊸⊑)𝕩}¨˜ Sin⊸⋈⟜Cos𝕩}
      │}
</pre>

</details>

<p>
Try running the simulation in the <a href="https://mlochbaum.github.io/BQN/try.html#code=U2lu4oC/Q29z4oC/R0NEIOKGkCDigKJtYXRoClUg4oaQIOKAonJhbmQuUmFuZ2UKX2NwIOKGkCB7KC3CtPCdlL3CqCnii4goK8K08J2UvcKoKeKfnOKMvX0KICAKZyDihpAgewogIElNIOKGkCAo4oqi4ouI4omi4qWK4p+cMOKKoinCqAogIHjigL9pZOKAv2gg4oeQICjijL3igL/iiqJ78J2VjvCdlal9wqg8PeKMnMuc4oaVMikg4oi+4peLSU0gPC3ijL4oMeKAvzHiirjiipEpMuKAvzLipYrDt+KImjIKICBzd2Fw4oC/Y25vdCDih5AgSU0g4p+oMeKAvzIsIDLigL8z4p+pIHvijL3ijL4o8J2VqOKKuOKKjynwnZWpfcKoIDw94oycy5zihpU0CiAgUCDih5Age+KfqD3ijJzLnOKGlTQsICA04oC/NOKlijDin6kge/CdlajijL4oM+KAvzPiirjiipEp8J2VqX3CqMucIFNpbuKKuOKLiOKfnENvc/Cdlal9Cn0KClEg4oaQIHvwnZWo8J2Vim5x4oC/cWM6CiAgd2Yg4oaQIDHijL7iipHiirjii4gw4qWKy5wy4ouGbnEKICBNIOKGkCAry53iiJjDl+KOiTHigL/iiJ4gX2NwCiAgSyDihpAgezHwnZWK8J2VqTrwnZWpOyDwnZWo8J2VijE68J2VqDsg8J2VqOKIvuKImMOX4p+cPF9jcPCdlal9CiAgTCDihpAge/CdlalL4o2f8J2VqDF9e0vCtOKfqGcuaWTwnZS9y5xucS3wnZWoK+KMijLii4bigbziiaDiipHwnZWpLCDwnZWpLCDwnZWo8J2UvWcuaWTin6l9CiAgVCDihpAg4oi+4oaV4oiY4omgeyjiiqLiiL4x4oaT4oy9KfCdlajihpPihpXwnZWo4oqR4p+c8J2Vqcuc4oCiX3doaWxlXz7wnZWo4oqR8J2VqX3CqDwKICBBIOKGkCB7MT3iiaDiipHwnZWoID8g8J2VqU3LnOKKkeKKuEzCtPCdlag7CiAgICDwnZWpTcK04p+oMOKKuEzCtPCdlajin6ko4oqi4oi+4oi+4p+c4oy9KUzin5xnLnN3YXDCqFTwnZWoKOKMveKImOKKouKIvsKs4oiY4oiKL+KKoynin5ziipHLnOKGlW5xCiAgfQogIMK74oq4POKIqGAwPvCdlagtYCvil4sow5fLnCnCtHdmIEHCtCDijL1xYwp9Cgpu4oC/YeKAv25x4oC/ciDihpAg4p+oMTUsIDExLCA1LCAwIFXLnCAy4ouGMTDin6kKCnNjIOKGkCDin6gKICDin6gw4p+p4oC/Zy5oIOKLhCDin6gx4p+p4oC/Zy5oIOKLhCDin6gy4p+p4oC/Zy5oCiAg4p+oMiwgM+KfqeKAv2cuY25vdCDii4Qg4p+oMiwgNOKfqeKAv2cuY25vdCDii4Qg4p+oMeKfqeKAv2cuaAogIOKfqOKfqDEsIDDin6ksIGcuUCDPgMO3MuKfqSDii4Qg4p+oMOKfqeKAv2cuaAogIOKfqOKfqDEsIDLin6ksIGcuUCDPgMO3NOKfqSDii4Qg4p+o4p+oMCwgMuKfqSwgZy5QIM+Aw7cy4p+pIOKLhCDin6gy4p+p4oC/Zy5oCuKfqQoKQyDihpAge24gKOKKo+KJocOXwrTiiJhHQ0QpICvigL8te/CdlanwnZWOMX3CqCA8YeKLhijiiaDDtzLDl+KKkeKImOKNkikgMOKMvuKKkSvLneKImOKAvygy4ouGbnEtMinipYrwnZWpfQoKQyArwrRR4p+cbnHigL9zY8Kocg==">BQN repl</a> and explore it!
If you are an Emacs user, the <code>org-mode</code> computational notebook in
the blog's <a href="https://github.com/Panadestein/blog">repository</a> provides the best experience.
</p>

<p>
One last thing: if you are particularly pedantic like me, you have by now realized that the
Shor's algorithm test above is a surprisingly weak unit test. Because it relies on extracting
global periodic structures, it can easily mask severe, localized topological routing bugs.
To formally verify our tensor geometry, we must test unitary reversibility:
</p>

<details>
<summary>Uncomputation test</summary>
</br>

<div class="org-src-container">
<pre class="src src-bqn">UC ← {𝕊nq‿depth:
  fs ← ⟨g.h⋈˜U ⋄ g.cnot⋈˜2⊸•rand.Deal ⋄ 2⊸•rand.Deal⋈·g.P 2×π×U∘0⟩⊏˜U⟜3 depth
  (⍉¨⋈⟜-´)⌾(1⊸⊑)¨∘⌽⊸∾{𝕏nq}¨fs
}
</pre>
</div>

<p>
By generating a chaotic sequence of parameterized gates and appending its exact conjugate-transpose
inverse in reverse chronological order, the total circuit evaluates to the identity matrix.
If our simulator's geometry is mathematically flawless, applying this circuit will perfectly
uncompute the system and restore the initial state vector unmodified:
</p>

<div class="org-src-container">
<pre class="src src-bqn">{(1⌾⊑0⥊˜2⋆𝕩) ≡ 0 U⊸Q𝕩⋈UC𝕩‿20} 10
</pre>
</div>

<pre class="example">
1
</pre>


</details>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Although conceptually straightforward, a Hilbert space of size <code>2⋆n</code> makes this type of simulation a true computational challenge.
For an efficient implementation, see <a href="https://arxiv.org/abs/1710.05867v4">arXiv:1710.05867</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This post's title is a playful recursive acronym that employs quantum computing terminology, without any specific significance
beyond that.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I golfed this down a fair bit, though true Kolmogorov complexity isn't the goal of course.
I'm not fond of that <code>•_while_</code> loop, but my only alternative is the under <code>{𝕩𝕊⍟≢⊏⟜𝕩⌾((/𝕩&lt;↕≠𝕩)⊸⊏)𝕩}</code>.
<b>Edit</b>: duh <code>{𝕩𝕊⍟≢⊒˜⊸⌊⊸⊏𝕩}</code>.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Hilbert's <a href="https://mathweb.ucsd.edu/~williams/motiv/hilbert.html">radio address</a> in 1930.
</p>

<div style="text-align: center; font-size: 2em; padding: 20px 0;">
  <a href="https://panadestein.github.io/blog/" style="text-decoration: none;">⊑∘∞</a>
</div></div></div>


</div>
</div></div>
</body>
</html>
